; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=101, out_folder=htg/blocksworld//training, instance_id=81, seed=2105

(define (problem blocksworld-81)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 b93 b94 b95 b96 b97 b98 b99 b100 b101 - object)
 (:init 
    (arm-empty)
    (clear b61)
    (on b61 b25)
    (on-table b25)
    (clear b92)
    (on b92 b94)
    (on b94 b45)
    (on b45 b13)
    (on b13 b4)
    (on-table b4)
    (clear b34)
    (on b34 b64)
    (on b64 b88)
    (on b88 b70)
    (on b70 b98)
    (on b98 b33)
    (on b33 b49)
    (on b49 b26)
    (on b26 b17)
    (on b17 b24)
    (on b24 b95)
    (on b95 b11)
    (on b11 b39)
    (on b39 b97)
    (on b97 b82)
    (on b82 b68)
    (on b68 b37)
    (on b37 b76)
    (on b76 b20)
    (on b20 b54)
    (on b54 b96)
    (on b96 b14)
    (on b14 b27)
    (on b27 b81)
    (on b81 b72)
    (on b72 b66)
    (on-table b66)
    (clear b101)
    (on b101 b36)
    (on b36 b71)
    (on b71 b69)
    (on b69 b51)
    (on b51 b31)
    (on b31 b41)
    (on b41 b42)
    (on b42 b32)
    (on b32 b86)
    (on b86 b43)
    (on b43 b84)
    (on b84 b100)
    (on b100 b58)
    (on b58 b67)
    (on b67 b60)
    (on b60 b53)
    (on b53 b87)
    (on b87 b16)
    (on b16 b48)
    (on b48 b59)
    (on b59 b23)
    (on b23 b44)
    (on b44 b80)
    (on b80 b21)
    (on b21 b30)
    (on b30 b22)
    (on b22 b89)
    (on b89 b28)
    (on b28 b52)
    (on b52 b38)
    (on b38 b18)
    (on-table b18)
    (clear b83)
    (on b83 b1)
    (on b1 b40)
    (on b40 b93)
    (on b93 b46)
    (on b46 b62)
    (on b62 b6)
    (on b6 b74)
    (on b74 b3)
    (on b3 b91)
    (on b91 b99)
    (on b99 b79)
    (on b79 b29)
    (on-table b29)
    (clear b7)
    (on b7 b15)
    (on b15 b77)
    (on b77 b73)
    (on b73 b47)
    (on b47 b65)
    (on b65 b50)
    (on b50 b35)
    (on b35 b2)
    (on b2 b12)
    (on b12 b75)
    (on b75 b5)
    (on b5 b63)
    (on b63 b9)
    (on b9 b10)
    (on b10 b57)
    (on b57 b85)
    (on b85 b56)
    (on b56 b8)
    (on b8 b90)
    (on b90 b55)
    (on b55 b78)
    (on b78 b19)
    (on-table b19))
 (:goal  (and 
    (clear b4)
    (on b4 b3)
    (on-table b3)
    (clear b1)
    (on b1 b10)
    (on b10 b5)
    (on b5 b8)
    (on b8 b7)
    (on b7 b2)
    (on b2 b6)
    (on b6 b9)
    (on-table b9))))

; plan
1. (unstack b83 b1)
   deleted: (on b83 b1) (clear b83) (arm-empty)
   added: (holding b83) (clear b1)
   goals met: 1 of 12
2. (putdown b83)
   deleted: (holding b83)
   added: (clear b83) (arm-empty) (on-table b83)
   goals met: 1 of 12
3. (unstack b92 b94)
   deleted: (on b92 b94) (clear b92) (arm-empty)
   added: (holding b92) (clear b94)
   goals met: 1 of 12
4. (putdown b92)
   deleted: (holding b92)
   added: (clear b92) (arm-empty) (on-table b92)
   goals met: 1 of 12
5. (unstack b94 b45)
   deleted: (on b94 b45) (clear b94) (arm-empty)
   added: (holding b94) (clear b45)
   goals met: 1 of 12
6. (putdown b94)
   deleted: (holding b94)
   added: (clear b94) (arm-empty) (on-table b94)
   goals met: 1 of 12
7. (unstack b45 b13)
   deleted: (on b45 b13) (clear b45) (arm-empty)
   added: (holding b45) (clear b13)
   goals met: 1 of 12
8. (putdown b45)
   deleted: (holding b45)
   added: (clear b45) (arm-empty) (on-table b45)
   goals met: 1 of 12
9. (unstack b13 b4)
   deleted: (on b13 b4) (clear b13) (arm-empty)
   added: (holding b13) (clear b4)
   goals met: 2 of 12
10. (putdown b13)
   deleted: (holding b13)
   added: (clear b13) (arm-empty) (on-table b13)
   goals met: 2 of 12
11. (unstack b1 b40)
   deleted: (on b1 b40) (clear b1) (arm-empty)
   added: (holding b1) (clear b40)
   goals met: 1 of 12
12. (putdown b1)
   deleted: (holding b1)
   added: (clear b1) (arm-empty) (on-table b1)
   goals met: 2 of 12
13. (unstack b40 b93)
   deleted: (on b40 b93) (clear b40) (arm-empty)
   added: (holding b40) (clear b93)
   goals met: 2 of 12
14. (putdown b40)
   deleted: (holding b40)
   added: (clear b40) (arm-empty) (on-table b40)
   goals met: 2 of 12
15. (unstack b93 b46)
   deleted: (on b93 b46) (clear b93) (arm-empty)
   added: (holding b93) (clear b46)
   goals met: 2 of 12
16. (putdown b93)
   deleted: (holding b93)
   added: (clear b93) (arm-empty) (on-table b93)
   goals met: 2 of 12
17. (unstack b46 b62)
   deleted: (on b46 b62) (clear b46) (arm-empty)
   added: (holding b46) (clear b62)
   goals met: 2 of 12
18. (putdown b46)
   deleted: (holding b46)
   added: (clear b46) (arm-empty) (on-table b46)
   goals met: 2 of 12
19. (unstack b62 b6)
   deleted: (on b62 b6) (clear b62) (arm-empty)
   added: (holding b62) (clear b6)
   goals met: 2 of 12
20. (putdown b62)
   deleted: (holding b62)
   added: (clear b62) (arm-empty) (on-table b62)
   goals met: 2 of 12
21. (unstack b6 b74)
   deleted: (on b6 b74) (clear b6) (arm-empty)
   added: (holding b6) (clear b74)
   goals met: 2 of 12
22. (putdown b6)
   deleted: (holding b6)
   added: (clear b6) (arm-empty) (on-table b6)
   goals met: 2 of 12
23. (unstack b74 b3)
   deleted: (on b74 b3) (clear b74) (arm-empty)
   added: (holding b74) (clear b3)
   goals met: 2 of 12
24. (putdown b74)
   deleted: (holding b74)
   added: (clear b74) (arm-empty) (on-table b74)
   goals met: 2 of 12
25. (unstack b3 b91)
   deleted: (on b3 b91) (clear b3) (arm-empty)
   added: (holding b3) (clear b91)
   goals met: 2 of 12
26. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 3 of 12
27. (pickup b4)
   deleted: (clear b4) (on-table b4) (arm-empty)
   added: (holding b4)
   goals met: 2 of 12
28. (stack b4 b3)
   deleted: (clear b3) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b3)
   goals met: 4 of 12
29. (unstack b7 b15)
   deleted: (on b7 b15) (clear b7) (arm-empty)
   added: (holding b7) (clear b15)
   goals met: 4 of 12
30. (putdown b7)
   deleted: (holding b7)
   added: (clear b7) (arm-empty) (on-table b7)
   goals met: 4 of 12
31. (unstack b15 b77)
   deleted: (on b15 b77) (clear b15) (arm-empty)
   added: (holding b15) (clear b77)
   goals met: 4 of 12
32. (putdown b15)
   deleted: (holding b15)
   added: (clear b15) (arm-empty) (on-table b15)
   goals met: 4 of 12
33. (unstack b77 b73)
   deleted: (on b77 b73) (clear b77) (arm-empty)
   added: (holding b77) (clear b73)
   goals met: 4 of 12
34. (putdown b77)
   deleted: (holding b77)
   added: (clear b77) (arm-empty) (on-table b77)
   goals met: 4 of 12
35. (unstack b73 b47)
   deleted: (on b73 b47) (clear b73) (arm-empty)
   added: (holding b73) (clear b47)
   goals met: 4 of 12
36. (putdown b73)
   deleted: (holding b73)
   added: (clear b73) (arm-empty) (on-table b73)
   goals met: 4 of 12
37. (unstack b47 b65)
   deleted: (on b47 b65) (clear b47) (arm-empty)
   added: (holding b47) (clear b65)
   goals met: 4 of 12
38. (putdown b47)
   deleted: (holding b47)
   added: (clear b47) (arm-empty) (on-table b47)
   goals met: 4 of 12
39. (unstack b65 b50)
   deleted: (on b65 b50) (clear b65) (arm-empty)
   added: (holding b65) (clear b50)
   goals met: 4 of 12
40. (putdown b65)
   deleted: (holding b65)
   added: (clear b65) (arm-empty) (on-table b65)
   goals met: 4 of 12
41. (unstack b50 b35)
   deleted: (on b50 b35) (clear b50) (arm-empty)
   added: (holding b50) (clear b35)
   goals met: 4 of 12
42. (putdown b50)
   deleted: (holding b50)
   added: (clear b50) (arm-empty) (on-table b50)
   goals met: 4 of 12
43. (unstack b35 b2)
   deleted: (on b35 b2) (clear b35) (arm-empty)
   added: (holding b35) (clear b2)
   goals met: 4 of 12
44. (putdown b35)
   deleted: (holding b35)
   added: (clear b35) (arm-empty) (on-table b35)
   goals met: 4 of 12
45. (unstack b2 b12)
   deleted: (on b2 b12) (clear b2) (arm-empty)
   added: (holding b2) (clear b12)
   goals met: 4 of 12
46. (stack b2 b6)
   deleted: (clear b6) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b6)
   goals met: 5 of 12
47. (pickup b7)
   deleted: (clear b7) (on-table b7) (arm-empty)
   added: (holding b7)
   goals met: 5 of 12
48. (stack b7 b2)
   deleted: (clear b2) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b2)
   goals met: 6 of 12
49. (unstack b12 b75)
   deleted: (on b12 b75) (clear b12) (arm-empty)
   added: (holding b12) (clear b75)
   goals met: 6 of 12
50. (putdown b12)
   deleted: (holding b12)
   added: (clear b12) (arm-empty) (on-table b12)
   goals met: 6 of 12
51. (unstack b75 b5)
   deleted: (on b75 b5) (clear b75) (arm-empty)
   added: (holding b75) (clear b5)
   goals met: 6 of 12
52. (putdown b75)
   deleted: (holding b75)
   added: (clear b75) (arm-empty) (on-table b75)
   goals met: 6 of 12
53. (unstack b5 b63)
   deleted: (on b5 b63) (clear b5) (arm-empty)
   added: (holding b5) (clear b63)
   goals met: 6 of 12
54. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 6 of 12
55. (unstack b63 b9)
   deleted: (on b63 b9) (clear b63) (arm-empty)
   added: (holding b63) (clear b9)
   goals met: 6 of 12
56. (putdown b63)
   deleted: (holding b63)
   added: (clear b63) (arm-empty) (on-table b63)
   goals met: 6 of 12
57. (unstack b9 b10)
   deleted: (on b9 b10) (clear b9) (arm-empty)
   added: (holding b9) (clear b10)
   goals met: 6 of 12
58. (putdown b9)
   deleted: (holding b9)
   added: (clear b9) (arm-empty) (on-table b9)
   goals met: 7 of 12
59. (unstack b10 b57)
   deleted: (on b10 b57) (clear b10) (arm-empty)
   added: (holding b10) (clear b57)
   goals met: 7 of 12
60. (stack b10 b5)
   deleted: (clear b5) (holding b10)
   added: (arm-empty) (clear b10) (on b10 b5)
   goals met: 8 of 12
61. (pickup b1)
   deleted: (clear b1) (on-table b1) (arm-empty)
   added: (holding b1)
   goals met: 7 of 12
62. (stack b1 b10)
   deleted: (clear b10) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b10)
   goals met: 9 of 12
63. (unstack b7 b2)
   deleted: (on b7 b2) (clear b7) (arm-empty)
   added: (holding b7) (clear b2)
   goals met: 8 of 12
64. (putdown b7)
   deleted: (holding b7)
   added: (clear b7) (arm-empty) (on-table b7)
   goals met: 8 of 12
65. (unstack b2 b6)
   deleted: (on b2 b6) (clear b2) (arm-empty)
   added: (holding b2) (clear b6)
   goals met: 7 of 12
66. (putdown b2)
   deleted: (holding b2)
   added: (clear b2) (arm-empty) (on-table b2)
   goals met: 7 of 12
67. (pickup b7)
   deleted: (clear b7) (on-table b7) (arm-empty)
   added: (holding b7)
   goals met: 7 of 12
68. (stack b7 b2)
   deleted: (clear b2) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b2)
   goals met: 8 of 12
69. (pickup b6)
   deleted: (clear b6) (on-table b6) (arm-empty)
   added: (holding b6)
   goals met: 8 of 12
70. (stack b6 b9)
   deleted: (clear b9) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b9)
   goals met: 9 of 12
71. (unstack b7 b2)
   deleted: (on b7 b2) (clear b7) (arm-empty)
   added: (holding b7) (clear b2)
   goals met: 8 of 12
72. (putdown b7)
   deleted: (holding b7)
   added: (clear b7) (arm-empty) (on-table b7)
   goals met: 8 of 12
73. (pickup b2)
   deleted: (clear b2) (on-table b2) (arm-empty)
   added: (holding b2)
   goals met: 8 of 12
74. (stack b2 b6)
   deleted: (clear b6) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b6)
   goals met: 9 of 12
75. (pickup b7)
   deleted: (clear b7) (on-table b7) (arm-empty)
   added: (holding b7)
   goals met: 9 of 12
76. (stack b7 b2)
   deleted: (clear b2) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b2)
   goals met: 10 of 12
77. (unstack b57 b85)
   deleted: (on b57 b85) (clear b57) (arm-empty)
   added: (holding b57) (clear b85)
   goals met: 10 of 12
78. (putdown b57)
   deleted: (holding b57)
   added: (clear b57) (arm-empty) (on-table b57)
   goals met: 10 of 12
79. (unstack b85 b56)
   deleted: (on b85 b56) (clear b85) (arm-empty)
   added: (holding b85) (clear b56)
   goals met: 10 of 12
80. (stack b85 b94)
   deleted: (clear b94) (holding b85)
   added: (arm-empty) (clear b85) (on b85 b94)
   goals met: 10 of 12
81. (unstack b56 b8)
   deleted: (on b56 b8) (clear b56) (arm-empty)
   added: (holding b56) (clear b8)
   goals met: 10 of 12
82. (putdown b56)
   deleted: (holding b56)
   added: (clear b56) (arm-empty) (on-table b56)
   goals met: 10 of 12
83. (unstack b8 b90)
   deleted: (on b8 b90) (clear b8) (arm-empty)
   added: (holding b8) (clear b90)
   goals met: 10 of 12
84. (stack b8 b7)
   deleted: (clear b7) (holding b8)
   added: (arm-empty) (clear b8) (on b8 b7)
   goals met: 11 of 12
85. (unstack b1 b10)
   deleted: (on b1 b10) (clear b1) (arm-empty)
   added: (holding b1) (clear b10)
   goals met: 9 of 12
86. (stack b1 b40)
   deleted: (clear b40) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b40)
   goals met: 10 of 12
87. (unstack b10 b5)
   deleted: (on b10 b5) (clear b10) (arm-empty)
   added: (holding b10) (clear b5)
   goals met: 9 of 12
88. (stack b10 b45)
   deleted: (clear b45) (holding b10)
   added: (arm-empty) (clear b10) (on b10 b45)
   goals met: 9 of 12
89. (pickup b5)
   deleted: (clear b5) (on-table b5) (arm-empty)
   added: (holding b5)
   goals met: 9 of 12
90. (stack b5 b8)
   deleted: (clear b8) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b8)
   goals met: 10 of 12
91. (unstack b10 b45)
   deleted: (on b10 b45) (clear b10) (arm-empty)
   added: (holding b10) (clear b45)
   goals met: 10 of 12
92. (stack b10 b5)
   deleted: (clear b5) (holding b10)
   added: (arm-empty) (clear b10) (on b10 b5)
   goals met: 11 of 12
93. (unstack b1 b40)
   deleted: (on b1 b40) (clear b1) (arm-empty)
   added: (holding b1) (clear b40)
   goals met: 10 of 12
94. (stack b1 b10)
   deleted: (clear b10) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b10)
   goals met: 12 of 12
